`terraform plan`
```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.members.github_membership.member["mumumu6"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "mumumu6"
    }

  # module.members.github_membership.member["shushuya0210"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "shushuya0210"
    }

  # module.hackathon.module.h24s_children_teams["h24s_04"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301520"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "hyde616"
        }
      + members {
          + role     = "maintainer"
          + username = "noya2ruler"
        }

        # (3 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_10"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301523"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "nokhnaton"
        }
      + members {
          + role     = "maintainer"
          + username = "ogu-kazemiya"
        }
      + members {
          + role     = "maintainer"
          + username = "pippi0057"
        }

        # (3 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_13"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301516"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "riku6174"
        }

        # (4 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_14"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301517"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "reiroop"
        }

        # (5 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_16"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301522"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "ayanakm"
        }

        # (5 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_18"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_18"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_18"].github_team_members.team_members will be created
  + resource "github_team_members" "team_members" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "Takeno-hito"
        }
      + members {
          + role     = "maintainer"
          + username = "aya-se"
        }
      + members {
          + role     = "member"
          + username = "mumumu6"
        }
      + members {
          + role     = "member"
          + username = "shushuya0210"
        }
    }

  # module.hackathon.module.h24s_children_teams["h24s_21"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301524"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "Pentakon"
        }
      + members {
          + role     = "maintainer"
          + username = "hatchch"
        }

        # (2 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_32"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301519"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "blancnoir256"
        }

        # (5 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_parent_team.github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10278337"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "member"
          + username = "H1rono"
        }
      + members {
          + role     = "member"
          + username = "Pentakon"
        }
      + members {
          + role     = "member"
          + username = "aya-se"
        }
      + members {
          + role     = "member"
          + username = "ayanakm"
        }
      + members {
          + role     = "member"
          + username = "blancnoir256"
        }
      + members {
          + role     = "member"
          + username = "hatchch"
        }
      + members {
          + role     = "member"
          + username = "hyde616"
        }
      + members {
          + role     = "member"
          + username = "mumumu6"
        }
      + members {
          + role     = "member"
          + username = "nokhnaton"
        }
      + members {
          + role     = "member"
          + username = "noya2ruler"
        }
      + members {
          + role     = "member"
          + username = "ogu-kazemiya"
        }
      + members {
          + role     = "member"
          + username = "pippi0057"
        }
      + members {
          + role     = "member"
          + username = "reiroop"
        }
      + members {
          + role     = "member"
          + username = "riku6174"
        }
      + members {
          + role     = "member"
          + username = "shushuya0210"
        }

        # (33 unchanged blocks hidden)
    }

Plan: 4 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

guarantee to take exactly these actions if you run "terraform apply" now.

```